html/alpine.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/org-static-blog/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/org-static-blog/html">
<title>Alpine</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">18 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/org-static-blog/html/alpine.html">Alpine</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org55f6ff2">1. Alpine&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tag1">tag1</span></span></a></li>
</ul>
</div>
</nav>

<div id="outline-container-org55f6ff2" class="outline-2">
<h2 id="org55f6ff2"><span class="section-number-2">1.</span> Alpine&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tag1">tag1</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>INSTALLATION GUIDE</code>
</p>

<ul class="org-ul">
<li><b>bold text</b> install virtual <i>underlined text</i> machine with 1gb and 10gb</li>
<li>ping google.com for internet connection</li>
<li>apk add sudo (might not need this, just enable community first)</li>
<li>timestamp active <span class="timestamp-wrapper"><span class="timestamp">[2023-12-16 Sat]</span></span></li>
<li>timestamp inactive <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-12-16 Sat&gt;</span></span></li>
<li>sudo apk add htop</li>
<li>test<sub>underscore</sub><sub>test</sub></li>
<li>vi /etc/apk/repositories - enable community one</li>
<li>apk<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> update</li>
<li>sudo apk add emacs</li>
<li>entities test &alpha;</li>
</ul>


<p>
huh what is this
</p>

<p>
:huh what is this 2
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
this is a footnote dude, how cool is that.
</p></div></div>


</div>
</div><div class="taglist"></div></div>
<div id="postamble" class="status"></div>
</body>
</html>
